Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/consumer_affairs/consumer_protection/consumer_complaints/where_to_complain_about_medical_professionals.html.txt.tmx
Source language: en
Languages: ga

source: Where to complain about medical professionals
ga: Cén áit le gearán a dhéanamh faoi Dhaoine Gairmiúla Leighis

source: The following are statutory regulatory bodies for the health and social care professions in Ireland
ga: Is iad seo a leanas na comhlachtaí rialaithe reachtúla do lucht gairmiúil leighis in Éirinn

source: In general, they promote high standards of professional conduct, maintain a register of qualified personnel and investigate allegations of professional misconduct or fitness to practice
ga: Go ginearálta, cuireann siad chun cinn ardchaighdeáin d’iompar gairmiúil, cothabhálann siad clár de phearsanra cáilithe agus déanann siad fiosrúchán ar mhí-iompar gairmiúil nó ar chumas i gcóir leigheas a chleachtadh

source: They usually have a Fitness to Practise or similar committee
ga: Go hiondúil, bíonn coiste do Chumas i gCóir Leighis a Chleachtadh acu nó coiste dá leithéid

source: This committee deals with complaints into the conduct of a registered practitioner
ga: Déileálann an coiste seo le gearáin maidir le hiompar chleachtóirí cláraithe

source: The complaint may be on the grounds of professional misconduct and/or fitness to engage in the practice by reason of physical or mental disability
ga: D’fhéadfadh an gearán a bheith faoi mhí-iompar gairmiúil agus/ nó faoi chumas le cleachtadh a dhéanamh mar gheall ar mhíchumas fisiciúil nó meabhrach

source: The Health and Social Care Professionals Act 2005 provided for a system of statutory registration for certain health and social care professions
ga: Chuir an tAcht um Ghairmithe Sláinte agus Cúraim Shóisialaigh córas um chlárú reachtúil ar fáil do dhá ghairm bheatha déag sláinte agus cúraim shóisialaigh

source: • Optometrists and dispensing opticians
ga: • Radharceolaithe agus radharceolaithe oftalmacha

source: • Speech and language therapists
ga: • Teiripeoirí urlabhra agus teanga

source: The Health and Social Care Professionals Council (CORU) was established in March 2007
ga: Bunaíodh an Chomhairle um Ghairmithe Sláinte agus Cúraim Shóisialaigh (CORU) i mí an Mhárta 2007

source: It is in the process of establishing a Registration Board for each of these professions, as well as a committee structure to deal with complaints made against registered professionals
ga: Tá Bord Clárúcháin á bhunú aici do gach ceann de na gairmeacha beatha seo, chomh maith le struchtúr coiste chun déileáil le gearáin a dhéantar in aghaidh gairmithe cláraithe

source: You can read more about the registration of social and health care professionals here
ga: Is féidir leat tuilleadh a léamh faoi chlárú na ngairmithe cúraim shóisialaigh agus sláinte anseo

source: In this document we give the regulatory bodies for the major health and social care professions
ga: Anseo, tugann muid na comhlachtaí rialaithe do na príomh-ghairmeacha leighis

source: You can read more about other health service agencies here
ga: Is féidir leat tuilleadh a léamh faoi ghníomhaireachtaí seirbhíse sláinte eile anseo

source: The Medical Council protects the interests of the public when dealing with registered medical practitioners
ga: Cosnaíonn an Chomhairle Leighis leasanna an phobail agus iad ag déileáil le cleachtóirí leighis cláraithe

source: Information on making a complaint is available on the Council's website
ga: Tá faisnéis maidir le gearán a dhéanamh ar fáil ar láithreán gréasáin na Comhairle

source: The Dental Council is a statutory body which provides for the registration of dentists
ga: Is comhlacht reachtúil é an Chomhairle Fiaclóireachta a dhéanann clárú ar fhiaclóirí

source: The Council can inquire into a registered dentist’s fitness to practise dentistry
ga: Is féidir leis an gComhairle ceist a chur faoi chumas an fhiaclóra chláraithe chun fiaclóireacht a chleachtadh

source: An Bord Altranais (The Nursing Board) is the statutory body which provides for the registration, control and education of nurses and for other matters relating to nurses and the practice of nursing
ga: Is comhlacht reachtúil é an Bord Altranais a chumasaíonn clárú, rialú agus oideachas na n-altraí agus cúrsaí nach iad a bhaineann le banaltraí agus cleachtadh an altranais

source: The Pharmaceutical Society of Ireland (PSI) is a statutory body, established under the Pharmacy Act 2007 as the pharmacy regulator
ga: Is comhlacht reachtúil é Cumann Cógaiseoirí na hÉireann (CCÉ) a bunaíodh faoin Acht Cógaisíochta 2007 mar an rialálaí cógaisíochta

source: It is charged with regulating the practice and profession of pharmacy
ga: Tá sé mar chúram aige cleachtais agus gairm na cógaisíochta a rialáil

source: All pharmacies and pharmacists must be registered with it
ga: Caithfidh gach cógaslann a bheith cláraithe leis

source: Their goal is the promotion of patient safety and public health, and its primary responsibility is to the general public
ga: Is í aidhm an Chumainn ná sábháilteacht na n-othar agus sláinte phoiblí a chur chun cinn, agus tá sé freagrach go príomhúil don phobal i gcoitinne

source: The Veterinary Council of Ireland was established under the Veterinary Practice Act 2005
ga: Bunaíodh Comhairle Tréidlianna na hÉireann faoin Acht um Chleachtadh Tréidliachta 2005

source: The main function of the Council is to regulate the practice of veterinary medicine and nursing in the public interest
ga: Is í príomhaidhm na Comhairle ná cleachtadh an leighis agus an altranais tréidliachta a rialáil chun leasa an phobail

source: Complementary and alternative healthcare practitioners are professionals who use acupuncture, herbs, homeopathy, therapeutic massage, oriental medicine or other methods to promote well being or treat health conditions
ga: Gairmithe iad cleachtóirí comhlántacha agus malartacha cúram sláinte a úsáideann snáthaidpholladh, luibheanna, hoiméapaite, suathaireacht theiripeach, cógas oirthearach nó modhanna eile chun folláine a chur chun cinn nó chun cóireáil a chur ar riochtaí sláinte

source: There are no statutory registration requirements for the practitioners of complementary therapies currently
ga: Níl aon riachtanais clárúcháin reachtúla do cheachtaitheoirí leigheas comhlántach in Éirinn faoi láthair

source: While they are not subject to statutory professional regulation, they are subject to legislation, similar to other practitioners, including consumer protection, health and safety, competition, contract and criminal law
ga: Cé nach mbíonn na cleachtóirí faoi réir rialáil ghairmiúil reachtúil, bíonn siad faoi réir reachtaíochta, ar nós cleachtóirí eile, an dlí cosanta tomhaltóirí, sláinte agus sábháilteachta, iomaíochais, conartha agus coiriúil ina measc

source: If you have a complaint against a medical professional, you can bring it to the attention of the relevant professional organisation
ga: Má tá gearán agat i gcoinne duine gairmiúil leighis, is féidir leat é a chur faoi bhráid na heagraíochta gairmiúla cuí

source: There is information on making a complaint about health and social care services at healthcomplaints.ie
ga: Tá eolas maidir le gearán a dhéanamh maidir le seirbhísí sláinte agus cúraim shóisialta ag healthcomplaints.ie

source: You can read general guidelines on making a complaint here
ga: Is féidir treoirlínte a léamh faoi ghearán a dhéanamh anseo
